"""
Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].

Выведите все элементы, которые меньше 5.
"""
a, b = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89], []

for i in a:
    if i < 5:
        b.append(i)

print(b)
# print(list(filter(lambda elem: elem < 5, a)))
# print([elem for elem in a if elem < 5])

"""
Даны списки:

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];

b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].

Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
"""
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

print([elem for elem in a if elem in b])
# result = list(filter(lambda elem: elem in b, a))
# result = list(set(a) & set(b))

"""Отсортируйте словарь по значению в порядке возрастания и убывания."""
